In [9]:
import os
import pandas as pd
import numpy as np

pd.set_option("display.max_rows", 1000)
pd.set_option('display.max_columns', 100)

In [10]:
import sys

sys.path.append("..")
from mc_lib.utils import size_and_ratio
sys.path.remove("..")
print(sys.path)

['/Users/mckim/anaconda3/envs/py36/lib/python36.zip', '/Users/mckim/anaconda3/envs/py36/lib/python3.6', '/Users/mckim/anaconda3/envs/py36/lib/python3.6/lib-dynload', '', '/Users/mckim/anaconda3/envs/py36/lib/python3.6/site-packages', '/Users/mckim/anaconda3/envs/py36/lib/python3.6/site-packages/IPython/extensions', '/Users/mckim/.ipython']

In [3]:


df_small = pd.read_csv("../v2/data/md_data_1percent_sampled_seed_1212.csv", dtype=str)
df_small.shape

(584874, 23)

In [4]:
df_small.describe()

,_id,baby_id,date,type,data_1,data_2,data_3,data_4,data_5,data_6,...,is_test,is_delete,weight,gender,birthday,convulsion,group_id,lat,lng,last_update_de
count,584874,584874,584874,584874,584858,495099,109264,373821,45617,371,...,584874,584874,584700,290329,584874,584874,67046,100888,100888,364534
unique,584840,8984,562988,7,23095,18083,469,236,1857,99,...,1,1,522,5,4497,4,66369,32627,10274,355325
top,22416616,19344,2021-05-29 00:15:08,1,0,C,1,0,맥시부펜,2.0,...,0,0,11.0,0,2016-11-24 00:00:00,0,20210529200656,37.52981,126.9378,2020-02-15 20:37:51
freq,2,5528,43,344461,105792,341461,94681,267074,8287,76,...,584874,584874,17489,114048,3634,428943,13,430,527,79

# Check type
1=체온, 2=해열제, 3=결과레포트(열나요조언), 4=memo (증상, 진단)

In [12]:
display(size_and_ratio(df_small, 'type'))

Sum : 584874 (7,)

        size     ratio
type
1     344461  0.588949
2     110393  0.188747
3      91107  0.155772
7      22397  0.038294
4      14129  0.024157
101     2254  0.003854
102      133  0.000227

# 성별
0=남자 , 1=여자

In [13]:
display(size_and_ratio(df_small, 'gender'))

Sum : 290329 (5,)

          size     ratio
gender
0       114048  0.392823
1       106292  0.366109
1.0      36200  0.124686
0.0      33543  0.115534
-1.0       246  0.000847

In [26]:
df_small['gender'] = df_small['gender'].astype(float)

display(size_and_ratio(df_small, 'gender'))

Sum : 290329 (3,)

          size     ratio
gender
 0.0    147591  0.508358
 1.0    142492  0.490795
-1.0       246  0.000847

# Birthday

In [27]:
display(size_and_ratio(df_small, 'birthday'))

Sum : 584874 (4497,)

                     size     ratio
birthday
2016-11-24 00:00:00  3634  0.006213
2016-11-24           2317  0.003962
2019-04-23           1852  0.003166
2016-08-21 00:00:00  1698  0.002903
2017-05-02           1349  0.002306
...                   ...       ...
1996-05-09              1  0.000002
2021-03-13              1  0.000002
1993-01-16              1  0.000002
1992-12-18              1  0.000002
2021-05-27              1  0.000002

[4497 rows x 2 columns]

# Convulsion

In [31]:
df_small['convulsion'] = df_small['convulsion'].astype(float)
display(size_and_ratio(df_small, 'convulsion', dropna=False))

Sum : 584874 (2,)

              size     ratio
convulsion
0.0         488836  0.835797
1.0          96038  0.164203

In [32]:
display(size_and_ratio(df_small, ['convulsion', 'gender'], dropna=False))

Sum : 584874 (7,)

                     size     ratio
convulsion gender
0.0        nan     265115  0.453286
           0.0     112325  0.192050
           1.0     111150  0.190041
1.0        0.0      35266  0.060297
           1.0      31342  0.053588
           nan      29430  0.050319
0.0        -1.0       246  0.000421